test/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "join room"
          data: { "room": "loadTestRoom", "username": "loadTester" }
      - think: 1
      - emit:
          channel: "chat message"
          data: { "room": "loadTestRoom", "message": "Load testing message" }
      - think: 1
      - listen: "chat message"